/**
  @file
  Display the ACPI tables

  Copyright (c) 2011-2012, Intel Corporation
  All rights reserved. This program and the accompanying materials
  are licensed and made available under the terms and conditions of the BSD License
  which accompanies this distribution.  The full text of the license may be found at
  http://opensource.org/licenses/bsd-license.php

  THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
  WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.

**/

#include <WebServer.h>
#include <Guid/Acpi.h>
#include <IndustryStandard/Acpi10.h>
#include <IndustryStandard/Acpi30.h>

#if defined(_MSC_VER)   //  Handle Microsoft VC++ compiler specifics.
#pragma warning ( disable : 4305 )
#endif  //  defined(_MSC_VER)

//
// Ensure proper structure formats
//
#pragma pack(1)

typedef struct {
  UINT8 AddressSpaceId;
  UINT8 RegisterBitWidth;
  UINT8 RegisterBitOffset;
  UINT8 AccessSize;
  UINT64 Address;
} GENERIC_ADDRESS;


typedef struct {
  UINT32 Signature;           //    0
  UINT32 Length;              //    4
  UINT8 Revision;             //    8
  UINT8 Checksum;             //    9
  UINT8 OemId[6];             //   10
  UINT8 OemTableId[8];        //   16
  UINT32 OemRevision;         //   24
  UINT32 CreatorId;           //   28
  UINT32 CreatorRevision;     //   32
  UINT8 DefinitionBlock[1];   //   36
} ACPI_DSDT;


typedef struct {
  UINT32 Signature;           //    0
  UINT32 Length;              //    4
  UINT8 Revision;             //    8
  UINT8 Checksum;             //    9
  UINT8 OemId[6];             //   10
  UINT8 OemTableId[8];        //   16
  UINT32 OemRevision;         //   24
  UINT32 CreatorId;           //   28
  UINT32 CreatorRevision;     //   32
  UINT32 FirmwareCtrl;        //   36
  UINT32 DSDT;                //   40
  UINT8 Reserved;             //   44
  UINT8 PreferredPmProfile;   //   45
  UINT16 SciInt;              //   46
  UINT32 SmiCmd;              //   48
  UINT8 AcpiEnable;           //   52
  UINT8 AcpiDisable;          //   53
  UINT8 S4BiosReq;            //   54
  UINT8 PStateCnt;            //   55
  UINT32 Pm1aEvtBlk;          //   56
  UINT32 Pm1bEvtBlk;          //   60
  UINT32 Pm1aCntBlk;          //   64
  UINT32 Pm1bCntBlk;          //   68
  UINT32 Pm2CntBlk;           //   72
  UINT32 PmTmrBlk;            //   76
  UINT32 Gpe0Blk;             //   80
  UINT32 Gpe1Blk;             //   84
  UINT8 Pm1EvtLen;            //   88
  UINT8 Pm1CntLen;            //   89
  UINT8 PM2CntLen;            //   90
  UINT8 PmTmrLen;             //   91
  UINT8 Gpe0BlkLen;           //   92
  UINT8 Gpe1BlkLen;           //   93
  UINT8 Gpe1Base;             //   94
  UINT8 CstCnt;               //   95
  UINT16 PLvl2Lat;            //   96
  UINT16 PLvl3Lat;            //   98
  UINT16 FlushSize;           //  100
  UINT16 FlushStride;         //  102
  UINT8 DutyOffset;           //  104
  UINT8 DutyWidth;            //  105
  UINT8 DayAlrm;              //  106
  UINT8 MonAlrm;              //  107
  UINT8 Century;              //  108
  UINT16 IapcBootArch;        //  109
  UINT8 Reserved2;            //  111
  UINT32 Flags;               //  112
  UINT32 ResetReg[3];         //  116
  UINT8 ResetValue;           //  128
  UINT8 Reserved3[3];         //  129
  UINT64 XFirmwareCtrl;       //  132
  UINT64 XDsdt;               //  140
  UINT32 XPm1aEvtBlk[3];      //  148
  UINT32 XPm1bEvtBlk[3];      //  160
  UINT32 XPm1aCntBlk[3];      //  172
  UINT32 XPm1bCntBlk[3];      //  184
  UINT32 XPm2CntBlk[3];       //  196
  UINT32 XPmTmrBlk[3];        //  208
  UINT32 XGpe0Blk[3];         //  220
  UINT32 XGpe1Blk[3];         //  232
} ACPI_FADT;


typedef struct {
  UINT32 Signature;
  UINT32 Length;
  UINT8 Revision;
  UINT8 Checksum;
  UINT8 OemId[6];
  UINT8 OemTableId[8];
  UINT32 OemRevision;
  UINT32 CreatorId;
  UINT32 CreatorRevision;
  UINT32 Entry[1];
} ACPI_RSDT;


typedef struct {
  UINT32 Signature;           //    0
  UINT32 Length;              //    4
} ACPI_UNKNOWN;

#pragma pack()


typedef struct {
  UINT32 Signature;
  CONST CHAR8 * pTableName;
  CONST CHAR16 * pWebPage;
} TABLE_SIGNATURE;


CONST TABLE_SIGNATURE mTableId[] = {
  { APIC_SIGNATURE, "APIC", PAGE_ACPI_APIC },
  { BGRT_SIGNATURE, "BGRT", PAGE_ACPI_BGRT },
  { DSDT_SIGNATURE, "DSDT", PAGE_ACPI_DSDT },
  { FADT_SIGNATURE, "FADT", PAGE_ACPI_FADT },
  { HPET_SIGNATURE, "HPET", PAGE_ACPI_HPET },
  { MCFG_SIGNATURE, "MCFG", PAGE_ACPI_MCFG },
  { SSDT_SIGNATURE, "SSDT", PAGE_ACPI_SSDT },
  { TCPA_SIGNATURE, "TCPA", PAGE_ACPI_TCPA },
